# Series

## Importando as bibliotecas

In [1]:
import pandas as pd

## Criando uma lista simples

In [2]:
data = [1, 2, 3, 4, 5]

## Incluindo a lista de dados em uma Series e melhorando a visualização

In [5]:
# Gerando a Series
pd.Series(data)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
# Incluindo a Series em uma variável
s = pd.Series(data)

In [7]:
# Visualizando os dados incluidos na variável
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
# Melhorando a visualização do Índice
index = ['Linha_' + str(i) for i in range(5)]

In [15]:
# Imprimindo o resultado armazendo na variável index
index

['Linha_0', 'Linha_1', 'Linha_2', 'Linha_3', 'Linha_4']

In [16]:
# Ajustando a Series com o resultado obtido na variável index
s = pd.Series(data = data, index = index)

In [17]:
# Imprimindo o resultado da Series após ajuste do index
s

Linha_0    1
Linha_1    2
Linha_2    3
Linha_3    4
Linha_4    5
dtype: int64

In [18]:
# Outra maneira é criar um dicionário e passá-lo para pd.Series e realizar a concatenação, estipulando o valor i + 1
data = {'Linha_' + str(i) : i + 1 for i in range(5)}

In [19]:
# Demonstrando o resultado
data

{'Linha_0': 1, 'Linha_1': 2, 'Linha_2': 3, 'Linha_3': 4, 'Linha_4': 5}

In [20]:
# Gerando a Series dos dados acima
s = pd.Series(data)

In [21]:
# Nesse caso não precisamos passar o index, já que usaremos a chave do dicionário que criamos. Então vamos visualizar como ficou
s

Linha_0    1
Linha_1    2
Linha_2    3
Linha_3    4
Linha_4    5
dtype: int64

## Realizando operações em nossa Series

In [25]:
# Somando o valor 2 em cada linha da Series
s1 = s + 2
s1

Linha_0    3
Linha_1    4
Linha_2    5
Linha_3    6
Linha_4    7
dtype: int64

In [26]:
# Podemos realizar as operações entre as Series, veja abaixo
s2 = s + s1
s2

Linha_0     4
Linha_1     6
Linha_2     8
Linha_3    10
Linha_4    12
dtype: int64

## Dataframe

In [27]:
# Gerando 3 listas dentro de uma lista
data = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

In [28]:
# Visualizando a lista contendo todas as 3 dentro
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [29]:
# Visualizando apenas o primeiro item da lista
data[0]

[1, 2, 3]

In [30]:
# Visualizando apenas o segundo item da lista
data[1]

[4, 5, 6]

In [33]:
# Visualizando apenas o terceiro item da lista
data[2]

[7, 8, 9]

In [35]:
# Gerando um dataframe com essa lista
df1 = pd.DataFrame(data = data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [37]:
# Criando os rótulos de linha, utilizando o index
index = ['Linha_' + str(i) for i in range(3)]
index

['Linha_0', 'Linha_1', 'Linha_2']

In [ ]:
# Alterando os nomes das colunas
columns = ['Coluna_' + str(i) for i in range(3)]

In [54]:
# Ajustando o dataframe com o índice e colunas geradas
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

         Coluna_0  Coluna_1  Coluna_2
Linha_0         1         2         3
Linha_1         4         5         6
Linha_2         7         8         9

In [41]:
# Alterando os nomes das colunas
columns = ['Coluna_' + str(i) for i in range(3)]
columns

['Coluna_0', 'Coluna_1', 'Coluna_2']

In [43]:
# Ajustando o dataframe com as colunas geradas
df2 = pd.DataFrame(data = data, index = index, columns = columns)
df2

         Coluna_0  Coluna_1  Coluna_2
Linha_0         1         2         3
Linha_1         4         5         6
Linha_2         7         8         9

In [48]:
# Obtendo o mesmo resultado utilizando dicionário
data = {
    'Coluna_0' : {'Linha_0' : 1, 'Linha_1' : 4, 'Linha_2' : 7},
    'Coluna_1' : {'Linha_0' : 2, 'Linha_1' : 5, 'Linha_2' : 8},
    'Coluna_2' : {'Linha_0' : 3, 'Linha_1' : 6, 'Linha_2' : 9}
}
data = pd.DataFrame(data)
data

         Coluna_0  Coluna_1  Coluna_2
Linha_0         1         2         3
Linha_1         4         5         6
Linha_2         7         8         9

In [50]:
# Atingindo o mesmo resultado por meio de uma lista de tuplas
data = [
    (1, 2, 3),
    (4, 5, 6),
    (7, 8, 9)
]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [52]:
# Criando novo dataframe com base nessa lista
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

         Coluna_0  Coluna_1  Coluna_2
Linha_0         1         2         3
Linha_1         4         5         6
Linha_2         7         8         9

## Atribuindo valores nos DataFrames através de uma condição

In [55]:
# Atribuindo a letra "A" para os valores maiores que 0 no DataFrame 1
df1[df1 > 0] = 'A'
df1

        Coluna_0 Coluna_1 Coluna_2
Linha_0        A        A        A
Linha_1        A        A        A
Linha_2        A        A        A

In [56]:
# Atribuindo a letra "B" para os valores maiores que 0 no DataFrame 2
df2[df2 > 0] = 'B'
df2

        Coluna_0 Coluna_1 Coluna_2
Linha_0        B        B        B
Linha_1        B        B        B
Linha_2        B        B        B

In [57]:
# Atribuindo a letra "B" para os valores maiores que 0 no DataFrame 2
df3[df3 > 0] = 'C'
df3

        Coluna_0 Coluna_1 Coluna_2
Linha_0        C        C        C
Linha_1        C        C        C
Linha_2        C        C        C

## Concatenar os DataFrames

In [58]:
# Concatenar os dataframes um embaixo do outro (Pelas Colunas)
df4 = pd.concat([df1, df2, df3])
df4

        Coluna_0 Coluna_1 Coluna_2
Linha_0        A        A        A
Linha_1        A        A        A
Linha_2        A        A        A
Linha_0        B        B        B
Linha_1        B        B        B
Linha_2        B        B        B
Linha_0        C        C        C
Linha_1        C        C        C
Linha_2        C        C        C

In [59]:
# Concatenar os dataframes um do lado do outro (Pelas Linhas)
df4 = pd.concat([df1, df2, df3], axis=1)
df4

,Coluna_0,Coluna_1,Coluna_2,Coluna_0,Coluna_1,Coluna_2,Coluna_0,Coluna_1,Coluna_2
Linha_0,A,A,A,B,B,B,C,C,C
Linha_1,A,A,A,B,B,B,C,C,C
Linha_2,A,A,A,B,B,B,C,C,C

# Exercícios

In [60]:
df1 = pd.DataFrame({'A' : {'X' : 1},
                    'B' : {'X' : 2},
                   })
df2 = pd.DataFrame({'C' : {'X' : 3},
                    'D' : {'X' : 4}
                   })
pd.concat([df1, df2])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [62]:
dados = [
    ('A', 'B'),
    ('C', 'D')
]
df = pd.DataFrame(dados, columns = ['L1', 'L2'], index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [65]:
dados = [
    [1, 2, 3],
    [4, 5, 6]
]
index = 'X, Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

    A  B  C
X   1  2  3
 Y  4  5  6

In [66]:
dados = {
    'A' : {'X' : 1, 'Y' : 3},
    'B' : {'X' : 2, 'Y' : 4}
}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4